import React from 'react'
import img from '../imgs/image 49.png'

const NewsListPage = () => {
  const news = [
    {
      title:
        'Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '1k',
      kommentars: '129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
    {
      title:
        '1Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '1k',
      kommentars: '129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
    {
      title:
        '2Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '1k',
      kommentars: '129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
    {
      title:
        '3Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '1k',
      kommentars: '129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
    {
      title:
        '4Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '1k',
      kommentars: '129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
    {
      title:
        '5Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '1k',
      kommentars: '129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
    {
      title:
        'Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '112k',
      kommentars: '129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
    {
      title:
        'Федун: врачи сборной не смогли уберечь Соболева от усугубления травмы',
      text: 'Владелец московского «Спартака» Леонид Федун заявил, что он недоволен работой врачей...',
      img: img,
      views: '1k',
      kommentars: '132129',
      date: '12 Янв, 2020',
      hrefs: ['футбол', 'суперлига'],
    },
  ]

  return (
    <div>
      <h1 className="text-darkBlue font-bold text-5xl ">Статьи</h1>

      <ul>
        {news.map((n) => (
          <li>
            <div>
              <img src={n.img} alt={n.title} />
              <div>
                <p>
                  <svg
                    width="16"
                    height="10"
                    viewBox="0 0 16 10"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M1.18042 4.91439C1.10623 4.83382 1.03856 4.75857 0.977716 4.68966C1.03856 4.62075 1.10623 4.54549 1.18042 4.46492C1.56706 4.04501 2.12628 3.48555 2.81515 2.92767C4.21311 1.79556 6.04612 0.75 8 0.75C9.95388 0.75 11.7869 1.79556 13.1848 2.92767C13.8737 3.48555 14.4329 4.04501 14.8196 4.46492C14.8938 4.54549 14.9614 4.62075 15.0223 4.68966C14.9614 4.75857 14.8938 4.83382 14.8196 4.91439C14.4329 5.3343 13.8737 5.89377 13.1848 6.45164C11.7869 7.58376 9.95388 8.62931 8 8.62931C6.04612 8.62931 4.21311 7.58376 2.81515 6.45164C2.12628 5.89377 1.56706 5.3343 1.18042 4.91439Z"
                      stroke="white"
                      stroke-width="1.5"
                    />
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M7.99785 6.4C9.76516 6.4 11.1979 4.96731 11.1979 3.2C11.1979 1.43269 9.76516 0 7.99785 0C6.23054 0 4.79785 1.43269 4.79785 3.2C4.79785 4.96731 6.23054 6.4 7.99785 6.4ZM6.89956 3.86223C7.50898 3.86223 8.00301 3.36819 8.00301 2.75878C8.00301 2.14936 7.50898 1.65533 6.89956 1.65533C6.29015 1.65533 5.79612 2.14936 5.79612 2.75878C5.79612 3.36819 6.29015 3.86223 6.89956 3.86223Z"
                      fill="white"
                    />
                  </svg>
                  {n.views}
                </p>
                <p>
                  <svg
                    width="16"
                    height="14"
                    viewBox="0 0 16 14"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M3.83999 10.462L4.52029 10.7778C4.6859 10.4209 4.54765 9.99678 4.20357 9.80607L3.83999 10.462ZM2.98895 12.0787L3.63207 12.4646H3.63207L2.98895 12.0787ZM3.03825 12.8697L2.44802 13.3324L2.44802 13.3324L3.03825 12.8697ZM3.7946 13.1063L3.57335 12.3897H3.57335L3.7946 13.1063ZM6.54307 11.3732L6.66006 10.6324C6.46103 10.601 6.25772 10.651 6.09595 10.7711L6.54307 11.3732ZM14.231 6.24289C14.231 7.40167 13.6065 8.50794 12.4836 9.35017C11.3604 10.1926 9.77431 10.7358 7.99051 10.7358V12.2358C10.0675 12.2358 11.9767 11.6053 13.3836 10.5502C14.7907 9.49484 15.731 7.97966 15.731 6.24289H14.231ZM7.99051 1.75C9.77431 1.75 11.3604 2.29321 12.4836 3.13561C13.6065 3.97783 14.231 5.0841 14.231 6.24289H15.731C15.731 4.50611 14.7907 2.99093 13.3836 1.93561C11.9767 0.880451 10.0675 0.25 7.99051 0.25V1.75ZM1.75 6.24289C1.75 5.0841 2.37451 3.97783 3.49747 3.13561C4.62067 2.29321 6.20672 1.75 7.99051 1.75V0.25C5.91355 0.25 4.00435 0.880451 2.59747 1.93561C1.19037 2.99093 0.25 4.50611 0.25 6.24289H1.75ZM4.20357 9.80607C2.64385 8.94156 1.75 7.62373 1.75 6.24289H0.25C0.25 8.32201 1.59053 10.0727 3.4764 11.118L4.20357 9.80607ZM3.63207 12.4646C3.86886 12.0699 4.20342 11.4605 4.52029 10.7778L3.15968 10.1463C2.86665 10.7777 2.55732 11.3404 2.34583 11.6928L3.63207 12.4646ZM3.62848 12.4069C3.6415 12.4235 3.64293 12.4465 3.63207 12.4646L2.34583 11.6928C2.03689 12.2077 2.07753 12.8599 2.44802 13.3324L3.62848 12.4069ZM3.57335 12.3897C3.59353 12.3835 3.61545 12.3903 3.62848 12.4069L2.44802 13.3324C2.81852 13.805 3.44209 14.0001 4.01585 13.8229L3.57335 12.3897ZM6.09595 10.7711C5.57822 11.1555 5.04482 11.5352 4.57752 11.8373C4.08538 12.1554 3.74024 12.3382 3.57335 12.3897L4.01585 13.8229C4.40588 13.7025 4.91099 13.4078 5.39185 13.097C5.89757 12.7701 6.45994 12.3691 6.9902 11.9754L6.09595 10.7711ZM7.99051 10.7358C7.5333 10.7358 7.08824 10.7 6.66006 10.6324L6.42609 12.1141C6.93193 12.1939 7.45522 12.2358 7.99051 12.2358V10.7358Z"
                      fill="white"
                    />
                  </svg>
                  {n.kommentars}
                </p>
              </div>
            </div>
          </li>
        ))}
      </ul>
    </div>
  )
}

export default NewsListPage
